export const faqQuestion = [
  {
    question: 'З чого краще проходити тести?',
    answer:
      'Рекомендується проходити тести з комп’ютера або ноутбука з сучасним браузером (Google Chrome, Microsoft Edge або Firefox). Також можна проходити з планшета, телефона, але на малому екрані можуть некоректно відображатися елементи тесту.',
  },
  {
    question: 'Що робити, якщо сторінка тесту зависла або не відкривається?',
    answer:
      'Перевірте стабільність свого інтернет-з’єднання і спробуйте оновити сторінку. Якщо проблема не зникла — очистіть кеш браузера або спробуйте зайти з іншого пристрою.',
  },
  {
    question: 'Як відбувається проходження тесту?',
    answer:
      "Після початку тесту питання з’являються по одному. Ви обираєте або вводите відповідь і натискаєте кнопку 'Next' або 'Finish' для завершення. Після цього система автоматично зберігає ваші результати.",
  },
  {
    question: 'Які типи питань можуть бути в тесті?',
    answer:
      'Існує кілька типів питань: з однією правильною відповіддю (Single Choice), з кількома варіантами (Multiple Choices), відкриті питання (Essay), а також завдання на співставлення (Matching Pairs).',
  },
  {
    question: 'Чи можна повернутися до попереднього питання?',
    answer:
      "У більшості випадків — ні. Тест побудований так, щоб перевірити ваші знання без можливості зміни відповідей. Тому уважно перевіряйте вибір перед натисканням 'Next'.",
  },
  {
    question: 'Що робити, якщо закінчився час?',
    answer:
      'Після завершення таймера тест автоматично завершується. Всі відповіді, які були вибрані, зберігаються.',
  },
  {
    question: 'Чи можна перепройти тест?',
    answer:
      'Ні, після завершення тесту повторне проходження можливе лише за дозволом адміністратора або викладача.',
  },
  {
    question: 'Як побачити свій результат?',
    answer:
      "Після завершення тесту система може автоматично показати ваш результат або повідомлення про успішне завершення. Якщо цього не сталося — перевірте розділ 'Мої результати' або зверніться до викладача.",
  },
  {
    question: 'Що робити, якщо з’являється помилка під час старту тесту?',
    answer:
      'Іноді при слабкому інтернеті або технічних збоях може з’являтися повідомлення про помилку. Просто оновіть сторінку (F5) або перезапустіть тест — система автоматично відновить сесію.',
  },
  {
    question: 'Чому я не бачу свою оцінку після завершення тесту?',
    answer:
      'Оцінка після проходження тесту відображається лише тоді, якщо викладач увімкнув цю опцію. Якщо опцію не активовано, ви побачите лише свої вибрані відповіді без оцінювання.',
  },
  {
    question: 'Що я можу побачити після завершення тесту?',
    answer:
      'Після завершення тесту система зазвичай показує ваші вибрані відповіді. У деяких випадках — якщо це дозволено викладачем — також можуть відображатися правильні відповіді та оцінка.',
  },
];
